Revit 2024 API
WorksetConfiguration Constructor
Overload List
Name | Description
WorksetConfiguration()
 Constructs a new workset configuration with an initial setting to open all user-created worksets.
WorksetConfiguration(WorksetConfiguration)
 Constructs a new copy of the input WorksetConfiguration object.
WorksetConfiguration(WorksetConfigurationOption)
 Constructs a new workset configuration with an initial setting to open or close all user-created worksets, or to open last viewed worksets.
See Also
WorksetConfiguration Class
WorksetConfiguration Members
Autodesk.Revit.DB Namespace